// Объясните значение "this"

// В представленном ниже коде мы намерены вызвать obj.go() метод 4 раза подряд.

// Но вызовы (1) и (2) работают иначе, чем (3) и (4). Почему?

'use strict';

let obj, method;

obj = {
  go: function() { alert(this); }
};

obj.go();               // (1) [object Object]

(obj.go)();             // (2) [object Object]

(method = obj.go)();    // (3) undefined

(obj.go || obj.stop)(); // (4) undefined

// Ответ - (1) и (2) это обычный вызов метода через точку, и this ссылается на объект перед точкой.
// (3) - здесь функция не передает значения this. (4) - потеря this.